import 'package:flutter/material.dart';

import '../../../../core/utils/hex_color.dart';

class AboutAppScreen extends StatelessWidget {
  const AboutAppScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      appBar: AppBar(
        iconTheme: IconThemeData(color: Colors.black),
        elevation: 0,
        backgroundColor: Colors.white,
        title: Text(
          'عن التطبيق',
          style: TextStyle(
            color: Colors.black54,
          ),
        ),
      ),
      body: SingleChildScrollView(
        child: Center(
          child: Padding(
            padding: const EdgeInsets.all(20.0),
            child: Column(
              children: [
                Container(
                  child: Column(
                    children: [
                      Image.asset('assets/images/splash.png'),
                      Text(
                        'دليل المساجد',
                        style: TextStyle(
                          color: Colors.black38,
                          fontSize: 20,
                        ),
                      ),
                      Text(
                        'اوصل لاقرب مسجد بسهولة',
                        style: TextStyle(
                          color: HexColor('#71C066'),
                          fontSize: 15,
                        ),
                      ),
                    ],
                  ),
                ),
                SizedBox(
                  height: 20,
                ),
                Text(
                  'عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق عن التطبيق ',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
